将鱼图像数据进行操作，使用numpy知识

# Pandas的数据结构

In [1]:
import numpy as np

import pandas as pd
from pandas import Series,DataFrame


# 绘图，可视化
import matplotlib.pyplot as plt


导入pandas：  
三剑客

### 1、Series

Series是一种类似与一维数组的对象，由下面两个部分组成：
- values：一组数据（ndarray类型）
- index：相关的数据索引标签

#### 1）Series的创建

两种创建方式：

(1) 由列表或numpy数组创建

    默认索引为0到N-1的整数型索引

In [7]:
s = Series(data = np.random.randint(0,150,size = 10),index = list('abcdefhijk'),name = 'Python')
s

a      4
b    115
c     78
d     39
e    140
f    106
h     35
i     29
j     29
k    125
Name: Python, dtype: int32

    还可以通过设置index参数指定索引

特别地，由ndarray创建的是引用，而不是副本。对Series元素的改变也会改变原来的ndarray对象中的元素。（列表没有这种情况）

(2) 由字典创建

In [3]:
s2 = Series({'A':144,'B':137,'C':125,'D':99})
s2

A    144
B    137
C    125
D     99
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

============================================

练习1：

使用多种方法创建以下Series，命名为s1：  
语文 150   
数学 150   
英语 150   
理综 300   

============================================

#### 2）Series的索引和切片

可以使用中括号取单个索引（此时返回的是元素类型），或者中括号里一个列表取多个索引（此时返回的仍然是一个Series类型）。分为显示索引和隐式索引：

(1) 显式索引：

    - 使用index中的元素作为索引值
    - 使用.loc[]（推荐）

 注意，此时是闭区间

In [9]:
s['d']

39

In [12]:
s[['d','e','e','e','d']]

d     39
e    140
e    140
e    140
d     39
Name: Python, dtype: int32

(2) 隐式索引：

    - 使用整数作为索引值
    - 使用.iloc[]（推荐）

 注意，此时是半开区间

In [13]:
s[0]

4

In [15]:
s

a      4
b    115
c     78
d     39
e    140
f    106
h     35
i     29
j     29
k    125
Name: Python, dtype: int32

In [14]:
s[2]

78

In [16]:
s[-1]

125

In [17]:
s.iloc[0]

4

In [18]:
s.iloc[2]

78

In [19]:
s.loc['a']

4

In [20]:
s.loc['b']

115

In [21]:
s['a':'f']

a      4
b    115
c     78
d     39
e    140
f    106
Name: Python, dtype: int32

In [22]:
s['a':'w']

a      4
b    115
c     78
d     39
e    140
f    106
h     35
i     29
j     29
k    125
Name: Python, dtype: int32

In [23]:
s['a':'fjsljflsjf']

a      4
b    115
c     78
d     39
e    140
f    106
Name: Python, dtype: int32

In [24]:
s[::2]

a      4
c     78
e    140
h     35
j     29
Name: Python, dtype: int32

In [25]:
s.loc['a':'h']

a      4
b    115
c     78
d     39
e    140
f    106
h     35
Name: Python, dtype: int32

In [26]:
s.loc[::-2]

k    125
i     29
f    106
d     39
b    115
Name: Python, dtype: int32

In [27]:
s.iloc[0:3]

a      4
b    115
c     78
Name: Python, dtype: int32

In [28]:
s.iloc[::3]

a      4
d     39
h     35
k    125
Name: Python, dtype: int32

============================================

练习2：

使用多种方法对练习1创建的Series s1进行索引和切片：

索引：
数学 150 

切片：
语文 150 
数学 150 
英语 150 

============================================

#### 3）Series的基本概念

可以把Series看成一个定长的有序字典

可以通过shape，size，index,values等得到series的属性

In [29]:
s.shape

(10,)

In [30]:
s.size

10

In [31]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'h', 'i', 'j', 'k'], dtype='object')

In [32]:
# Series中的值是ndarray
s.values

array([  4, 115,  78,  39, 140, 106,  35,  29,  29, 125])

可以通过head(),tail()快速查看Series对象的样式

In [33]:
s.head()

a      4
b    115
c     78
d     39
e    140
Name: Python, dtype: int32

In [34]:
s.tail()

f    106
h     35
i     29
j     29
k    125
Name: Python, dtype: int32

当索引没有对应的值时，可能出现缺失数据显示NaN（not a number）的情况

In [37]:
s[['d','i']]= np.NaN
s

a      4.0
b    115.0
c     78.0
d      NaN
e    140.0
f    106.0
h     35.0
i      NaN
j     29.0
k    125.0
Name: Python, dtype: float64

可以使用pd.isnull()，pd.notnull()，或自带isnull(),notnull()函数检测缺失数据

In [39]:
# 查找空数据
cond = s.isnull()

s[cond]

d   NaN
i   NaN
Name: Python, dtype: float64

In [41]:
# 删选非空数据
cond = s.notnull()
s[cond]

a      4.0
b    115.0
c     78.0
e    140.0
f    106.0
h     35.0
j     29.0
k    125.0
Name: Python, dtype: float64

Series对象本身及其实例都有一个name属性

In [42]:
s

a      4.0
b    115.0
c     78.0
d      NaN
e    140.0
f    106.0
h     35.0
i      NaN
j     29.0
k    125.0
Name: Python, dtype: float64

In [43]:
s2

A    144
B    137
C    125
D     99
dtype: int64

In [45]:
s2.name = 'Math'

In [46]:
s2

A    144
B    137
C    125
D     99
Name: Math, dtype: int64

#### 4）Series的运算

(1) 适用于numpy的数组运算也适用于Series

In [48]:
s + 10

a     14.0
b    125.0
c     88.0
d      NaN
e    150.0
f    116.0
h     45.0
i      NaN
j     39.0
k    135.0
Name: Python, dtype: float64

In [51]:
s3 = s.add(10,fill_value=0)
s3

a     14.0
b    125.0
c     88.0
d     10.0
e    150.0
f    116.0
h     45.0
i     10.0
j     39.0
k    135.0
Name: Python, dtype: float64

In [53]:
s3.astype(np.uint8)

a     14
b    125
c     88
d     10
e    150
f    116
h     45
i     10
j     39
k    135
Name: Python, dtype: uint8

In [54]:
s.mean()

79.0

In [55]:
s.median()

92.0

In [56]:
s.max()

140.0

In [57]:
s.std()

50.60208917200384

In [58]:
s.pow(2)

a       16.0
b    13225.0
c     6084.0
d        NaN
e    19600.0
f    11236.0
h     1225.0
i        NaN
j      841.0
k    15625.0
Name: Python, dtype: float64

In [60]:
s

a      4.0
b    115.0
c     78.0
d      NaN
e    140.0
f    106.0
h     35.0
i      NaN
j     29.0
k    125.0
Name: Python, dtype: float64

In [59]:
s.value_counts()

125.0    1
29.0     1
35.0     1
106.0    1
140.0    1
78.0     1
115.0    1
4.0      1
Name: Python, dtype: int64

In [61]:
li = ['xxxx.mp3','sfsa.wav','xfjs.mp3','fssfs.als','sfsjeio.ps','sfjsljfs.als']

In [64]:
def count_suffix(li):
    
    return Series([l.split('.')[-1] for l in li]).value_counts()[:2]

In [65]:
count_suffix(li)

als    2
mp3    2
dtype: int64

In [68]:
s.var()

2560.5714285714284

(2) Series之间的运算

- 在运算中自动对齐不同索引的数据
- 如果索引不对应，则补NaN

- 注意：要想保留所有的index，则需要使用.add()函数

In [69]:
s2

A    144
B    137
C    125
D     99
Name: Math, dtype: int64

In [71]:
s3 = Series({'A':88,'B':124,'C':67})
s3

A     88
B    124
C     67
dtype: int64

In [72]:
s2 + s3

A    232.0
B    261.0
C    192.0
D      NaN
dtype: float64

In [73]:
99 + np.NaN

nan

In [74]:
s2.add(s3,fill_value=0)

A    232.0
B    261.0
C    192.0
D     99.0
dtype: float64

============================================

练习3：

1. 想一想Series运算和ndarray运算的规则有什么不同？

2. 新建另一个索引包含“文综”的Series s2，并与s2进行多种算术操作。思考如何保存所有数据。

============================================

### 2、DataFrame

DataFrame是一个【表格型】的数据结构，可以看做是【由Series组成的字典】（共用同一个索引）。DataFrame由按一定顺序排列的多列数据组成。设计初衷是将Series的使用场景从一维拓展到多维。DataFrame既有行索引，也有列索引。
- 行索引：index
- 列索引：columns
- 值：values（numpy的二维数组）

#### 1）DataFrame的创建
最常用的方法是传递一个字典来创建。DataFrame以字典的键作为每一【列】的名称，以字典的值（一个数组）作为每一列。

此外，DataFrame会自动加上每一行的索引（和Series一样）。

同Series一样，若传入的列与字典的键不匹配，则相应的值为NaN。

In [75]:
df = DataFrame(data = {'Python':np.random.randint(0,150,size =5 ),
                       'Math':np.random.randint(0,150,size = 5),
                       'En':np.random.randint(0,150,size = 5)},
               index = list('ABCDE'))
df

   Python  Math   En
A      63    39  125
B     108   149   68
C       0    32  110
D     122   145    7
E      67    77   94

In [76]:
df2 = DataFrame(data = np.random.randint(0,150,size = (10,4)),
                index = list('ABCDEFHIJK'),
                columns=['Python','Math','En','Physic'])

df2

   Python  Math   En  Physic
A      51     4   53      50
B       0    16   57     138
C     129    39  109      82
D     137   111   71      69
E      76    90   24     101
F      10   111  107      44
H       9    17   72      72
I      86   128  101      58
J      49    44   82      26
K      54    48   17      63

In [89]:
df2.to_csv('./data.csv')

In [78]:
df2.to_excel('./data.xlsx')

In [88]:
df3 = pd.read_csv('./data.txt')
df4 = df3.rename(mapper = {'Unnamed: 0':'index'},axis = 1)
df4.set_index(keys = 'index')

       Python  Math   En  Physic
index
A          51     4   53      50
B           0    16   57     138
C         129    39  109      82
D         137   111   71      69
E          76    90   24     101
F          10   111  107      44
H           9    17   72      72
I          86   128  101      58
J          49    44   82      26
K          54    48   17      63

In [90]:
pd.read_excel('./data.xlsx')

   Python  Math   En  Physic
A      51     4   53      50
B       0    16   57     138
C     129    39  109      82
D     137   111   71      69
E      76    90   24     101
F      10   111  107      44
H       9    17   72      72
I      86   128  101      58
J      49    44   82      26
K      54    48   17      63

In [ ]:
# 结构化数据 sql  df结构化数据
# 半结构化数据
# 非结构化数据

DataFrame属性：values、columns、index、shape

In [91]:
df.values

array([[ 63,  39, 125],
       [108, 149,  68],
       [  0,  32, 110],
       [122, 145,   7],
       [ 67,  77,  94]])

In [92]:
df.columns

Index(['Python', 'Math', 'En'], dtype='object')

In [93]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [94]:
df.shape

(5, 3)

In [95]:
df.dtypes

Python    int32
Math      int32
En        int32
dtype: object

============================================

练习4：

根据以下考试成绩表，创建一个DataFrame，命名为df：
```
    张三  李四
语文 150  0
数学 150  0
英语 150  0
理综 300  0
```

============================================

#### 2）DataFrame的索引

(1) 对列进行索引

    - 通过类似字典的方式
    - 通过属性的方式

 可以将DataFrame的列获取为一个Series。返回的Series拥有原DataFrame相同的索引，且name属性也已经设置好了，就是相应的列名。

In [97]:
df2.Python

A     51
B      0
C    129
D    137
E     76
F     10
H      9
I     86
J     49
K     54
Name: Python, dtype: int32

In [98]:
df2.En

A     53
B     57
C    109
D     71
E     24
F    107
H     72
I    101
J     82
K     17
Name: En, dtype: int32

In [99]:
df2['Math']

A      4
B     16
C     39
D    111
E     90
F    111
H     17
I    128
J     44
K     48
Name: Math, dtype: int32

In [100]:
df2[['Math','En']]

   Math   En
A     4   53
B    16   57
C    39  109
D   111   71
E    90   24
F   111  107
H    17   72
I   128  101
J    44   82
K    48   17

(2) 对行进行索引

    - 使用.ix[]来进行行索引
    - 使用.loc[]加index来进行行索引
    - 使用.iloc[]加整数来进行行索引
    
 同样返回一个Series，index为原来的columns。

In [102]:
df2.A

AttributeError: 'DataFrame' object has no attribute 'A'

In [103]:
df2['A']

KeyError: 'A'

In [104]:
df2.loc['A']

Python    51
Math       4
En        53
Physic    50
Name: A, dtype: int32

In [105]:
df2.loc[['A','C']]

   Python  Math   En  Physic
A      51     4   53      50
C     129    39  109      82

In [108]:
pd.__version__

'0.23.0'

In [107]:
df2.iloc[[3,5]]

   Python  Math   En  Physic
D     137   111   71      69
F      10   111  107      44

(3) 对元素索引的方法
    - 使用列索引
    - 使用行索引(iloc[3,1]相当于两个参数;iloc[[3,3]] 里面的[3,3]看做一个参数)
    - 使用values属性（二维numpy数组）

In [110]:
df2['Math']['C']

39

In [111]:
df2.loc['C']['Python']

129

In [112]:
df2

   Python  Math   En  Physic
A      51     4   53      50
B       0    16   57     138
C     129    39  109      82
D     137   111   71      69
E      76    90   24     101
F      10   111  107      44
H       9    17   72      72
I      86   128  101      58
J      49    44   82      26
K      54    48   17      63

In [113]:
df2.loc['B','En']

57

In [114]:
df2['En','B']

KeyError: ('En', 'B')

In [ ]:
pic.shape = (334,280,3)

【注意】
直接用中括号时：
- 索引表示的是列索引
- 切片表示的是行切片

In [116]:
df2['Python':'En']

Empty DataFrame
Columns: [Python, Math, En, Physic]
Index: []

In [118]:
df2['A':'F']

   Python  Math   En  Physic
A      51     4   53      50
B       0    16   57     138
C     129    39  109      82
D     137   111   71      69
E      76    90   24     101
F      10   111  107      44

In [119]:
df2.loc['A':'F']

   Python  Math   En  Physic
A      51     4   53      50
B       0    16   57     138
C     129    39  109      82
D     137   111   71      69
E      76    90   24     101
F      10   111  107      44

In [120]:
df2.iloc[0:5]

   Python  Math   En  Physic
A      51     4   53      50
B       0    16   57     138
C     129    39  109      82
D     137   111   71      69
E      76    90   24     101

In [121]:
df2.loc['Python':'En']

Empty DataFrame
Columns: [Python, Math, En, Physic]
Index: []

In [122]:
df2.iloc[:,1:3]

   Math   En
A     4   53
B    16   57
C    39  109
D   111   71
E    90   24
F   111  107
H    17   72
I   128  101
J    44   82
K    48   17

============================================

练习5：

使用多种方法对ddd进行索引和切片，并比较其中的区别

============================================

#### 3）DataFrame的运算

In [125]:
df2 - 10

   Python  Math  En  Physic
A      41    -6  43      40
B     -10     6  47     128
C     119    29  99      72
D     127   101  61      59
E      66    80  14      91
F       0   101  97      34
H      -1     7  62      62
I      76   118  91      48
J      39    34  72      16
K      44    38   7      53

In [126]:
df2.pow(2)

   Python   Math     En  Physic
A    2601     16   2809    2500
B       0    256   3249   19044
C   16641   1521  11881    6724
D   18769  12321   5041    4761
E    5776   8100    576   10201
F     100  12321  11449    1936
H      81    289   5184    5184
I    7396  16384  10201    3364
J    2401   1936   6724     676
K    2916   2304    289    3969

In [128]:
df2.divide(3).round(2)

   Python   Math     En  Physic
A   17.00   1.33  17.67   16.67
B    0.00   5.33  19.00   46.00
C   43.00  13.00  36.33   27.33
D   45.67  37.00  23.67   23.00
E   25.33  30.00   8.00   33.67
F    3.33  37.00  35.67   14.67
H    3.00   5.67  24.00   24.00
I   28.67  42.67  33.67   19.33
J   16.33  14.67  27.33    8.67
K   18.00  16.00   5.67   21.00

![](xiefangcha.jpg)

In [129]:
df2.cov()

             Python         Math           En      Physic
Python  2284.544444   862.244444   222.855556 -137.922222
Math     862.244444  2053.511111   414.955556 -298.600000
En       222.855556   414.955556  1042.011111 -331.988889
Physic  -137.922222  -298.600000  -331.988889  993.122222

In [130]:
df2.corr()

          Python      Math        En    Physic
Python  1.000000  0.398091  0.144440 -0.091566
Math    0.398091  1.000000  0.283672 -0.209093
En      0.144440  0.283672  1.000000 -0.326352
Physic -0.091566 -0.209093 -0.326352  1.000000

In [131]:
df2.any()

Python    True
Math      True
En        True
Physic    True
dtype: bool

In [132]:
df2.all()

Python    False
Math       True
En         True
Physic     True
dtype: bool

In [133]:
df2.var()

Python    2284.544444
Math      2053.511111
En        1042.011111
Physic     993.122222
dtype: float64

In [135]:
df2['Physic'] = 105
df2

   Python  Math   En  Physic
A      51     4   53     105
B       0    16   57     105
C     129    39  109     105
D     137   111   71     105
E      76    90   24     105
F      10   111  107     105
H       9    17   72     105
I      86   128  101     105
J      49    44   82     105
K      54    48   17     105

In [136]:
df2.var()

Python    2284.544444
Math      2053.511111
En        1042.011111
Physic       0.000000
dtype: float64

In [138]:
df2.iloc[3,3] = None
df2

   Python  Math   En  Physic
A      51     4   53   105.0
B       0    16   57   105.0
C     129    39  109   105.0
D     137   111   71     NaN
E      76    90   24   105.0
F      10   111  107   105.0
H       9    17   72   105.0
I      86   128  101   105.0
J      49    44   82   105.0
K      54    48   17   105.0

In [137]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, A to K
Data columns (total 4 columns):
Python    10 non-null int32
Math      10 non-null int32
En        10 non-null int32
Physic    10 non-null int64
dtypes: int32(3), int64(1)
memory usage: 600.0+ bytes

In [140]:
df2.shape

(10, 4)

In [141]:
40*32/4

320.0

In [139]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, A to K
Data columns (total 4 columns):
Python    10 non-null int32
Math      10 non-null int32
En        10 non-null int32
Physic    9 non-null float64
dtypes: float64(1), int32(3)
memory usage: 600.0+ bytes

In [142]:
df2.describe()

           Python        Math          En  Physic
count   10.000000   10.000000   10.000000     9.0
mean    60.100000   60.800000   69.300000   105.0
std     47.796908   45.315683   32.280197     0.0
min      0.000000    4.000000   17.000000   105.0
25%     19.750000   22.500000   54.000000   105.0
50%     52.500000   46.000000   71.500000   105.0
75%     83.500000  105.750000   96.250000   105.0
max    137.000000  128.000000  109.000000   105.0

（1） DataFrame之间的运算

同Series一样：

- 在运算中自动对齐不同索引的数据
- 如果索引不对应，则补NaN

创建DataFrame df1 不同人员的各科目成绩，月考一

In [143]:
df1 = DataFrame(np.random.randint(0,150,size = (5,3)),index=list('ABCDE'),columns=['Python','Math','En'])
df1

   Python  Math  En
A     119   130  60
B       6    76  68
C      12    47  91
D     123    10  82
E      46    98  86

创建DataFrame df2 不同人员的各科目成绩，月考二  
有新学生转入

In [144]:
df2 = DataFrame(np.random.randint(0,150,size = (6,3)),index = list('ABCDEF'),columns=['Python','Math','En'])
df2

   Python  Math   En
A      55    95   70
B      56    58   73
C     126    41   64
D      30    26  101
E     137   116  124
F      95   116   31

In [145]:
df1 + df2

   Python   Math     En
A   174.0  225.0  130.0
B    62.0  134.0  141.0
C   138.0   88.0  155.0
D   153.0   36.0  183.0
E   183.0  214.0  210.0
F     NaN    NaN    NaN

下面是Python 操作符与pandas操作函数的对应表：

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

In [147]:
df3 = df1.add(df2,fill_value=0)
df3

   Python   Math     En
A   174.0  225.0  130.0
B    62.0  134.0  141.0
C   138.0   88.0  155.0
D   153.0   36.0  183.0
E   183.0  214.0  210.0
F    95.0  116.0   31.0

In [149]:
df3

   Python   Math     En
A   174.0  225.0  130.0
B    62.0  134.0  141.0
C   138.0   88.0  155.0
D   153.0   36.0  183.0
E   183.0  214.0  210.0
F    95.0  116.0   31.0

In [150]:
df3.loc['A':'E'] = df3.loc['A':'E']/2

In [151]:
df3

   Python   Math     En
A    87.0  112.5   65.0
B    31.0   67.0   70.5
C    69.0   44.0   77.5
D    76.5   18.0   91.5
E    91.5  107.0  105.0
F    95.0  116.0   31.0

（2） Series与DataFrame之间的运算

【重要】

- 使用Python操作符：以行为单位操作（参数必须是行），对所有行都有效。（类似于numpy中二维数组与一维数组的运算，但可能出现NaN）

- 使用pandas操作函数：

        axis=0：以列为单位操作（参数必须是列），对所有列都有效。
        axis=1：以行为单位操作（参数必须是行），对所有行都有效。

In [152]:
df1

   Python  Math  En
A     119   130  60
B       6    76  68
C      12    47  91
D     123    10  82
E      46    98  86

In [153]:
s1 = df1.loc['A']
s1

Python    119
Math      130
En         60
Name: A, dtype: int32

In [154]:
# 符合广播机制
df1.add(s1)

   Python  Math   En
A     238   260  120
B     125   206  128
C     131   177  151
D     242   140  142
E     165   228  146

In [155]:
# axis : {0, 1, 'index', 'columns'}
df1.add(s1,axis = 'index')

        Python  Math  En
A          NaN   NaN NaN
B          NaN   NaN NaN
C          NaN   NaN NaN
D          NaN   NaN NaN
E          NaN   NaN NaN
En         NaN   NaN NaN
Math       NaN   NaN NaN
Python     NaN   NaN NaN

In [156]:
df1.add(s1,axis = 'columns')

   Python  Math   En
A     238   260  120
B     125   206  128
C     131   177  151
D     242   140  142
E     165   228  146

In [157]:
s2 = df1.Python
s2

A    119
B      6
C     12
D    123
E     46
Name: Python, dtype: int32

In [ ]:
df1.cov()

In [159]:
df1.add(s2,axis = 'index')

   Python  Math   En
A     238   249  179
B      12    82   74
C      24    59  103
D     246   133  205
E      92   144  132

============================================

练习6：

1. 假设ddd是期中考试成绩，ddd2是期末考试成绩，请自由创建ddd2，并将其与ddd相加，求期中期末平均值。

2. 假设张三期中考试数学被发现作弊，要记为0分，如何实现？

3. 李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？

4. 后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？

============================================